<script setup></script>

<template>
  <div class="bg-gray-50">
    <article class="lg:mx-auto lg:w-lg px-2 py-4">
      <h1 class="text-center text-3xl font-black px-4 mb-4">
        THE THINGS WE DO FOR DREAMS<br />美夢成真 基富通智能平台
      </h1>
      <h3 class="text-2xl font-black my-2 tracking-widest">我們的使命</h3>
      <p class="tracking-widest leading-loose mb-8">
        「基富通幫助投資人以合理的成本、足夠的資訊、方便的介面，在網路上安心地投資基金」。
      </p>
      <p class="tracking-widest leading-loose mb-8">
        全球網路科技興起，金融科技(Financial Technology,
        FinTech)以「客戶為中心」的發展理念，正在形塑金融服務業的新面貌，如何在網路銷售基金，將金融科技創新理念導入服務流程，並且將產品端的基金公司與購買端的投資人，透過創新科技的基金網路平台將兩者相互結合，達到市場共贏的效果，是未來基金網路銷售平台發展的最大挑戰，「基富通」的營運方式即是以開放平台為架構，符合金融科技創新及市場通路多元化服務需求，結合機器人理財(Robot
        Advisor)等智能服務與大數據行銷，並結合社群分享讓投資人的理財更加融入生活，正符合未來最具影響力的金融創新經營方式。
      </p>
      <h3 class="text-2xl font-black my-2 tracking-widest">公司沿革</h3>
      <p class="tracking-widest leading-loose mb-8">
        基富通證券股份有限公司﹝以下簡稱「基富通」﹞是臺灣集中保管結算所及櫃檯買賣中心為創始股東，並結合34家國內外資產管理公司成立。基富通於2015年11月9日召開公司籌備會及第一次發起人會議，由臺灣集中保管結算所及櫃檯買賣中心先行出資新臺幣2.1億元籌設公司，2016年1月27日取得證期局許可證照，2016年5月31日完成第一次增資，增資後實收資本額至3億5千萬元，本次增資主要目的係透過股東多元化以結合資產管理業者的專業實力，共34家投信投顧業者入股。2017年8月15日完成第二次增資，本次增資主要目的為健全公司財務結構與充實未來營運所需資金，因應金融科技業務發展規劃，增資後實收資本額至6億元，投信投顧業者占比為38.36%。目前董事包括臺灣集中保管結算所暨基富通證券董事長林修銘、基富通證券總經理黃致淵、臺灣集中保管結算所副總經理景廣俐、Verizon
        Media台灣董事總經理王興、巨思文化股份有限公司執行長陳素蘭、櫃檯買賣中心副總經理林瑛珪、國泰投信董事長張錫、復華投信董事長杜俊雄及富蘭克林投顧創辦人劉吉人等；監察人由資策會副執行長楊仁達、富邦投信董事長史綱及前財金資訊公司總經理林孟津擔任，共計9席董事與3席監察人。
      </p>
      <p class="tracking-widest leading-loose mb-8">
        董事會成員涵蓋資產管理、金流、電商及資訊產業之業界翹楚。其中國泰投信、富邦投信、復華投信及富蘭克林投顧為資產管理界之標竿，透過多元的成員組成與堅實的公司治理，基富通能在肩負公益性的政策使命下，充分運用市場業者力量，結合數位金融打造兼具智能與人性化的基金網路行銷平台，未來發展將全力實踐基富通成立的宗旨和核心價值，為我們的客户、投資人、業務伙伴及社會大眾提供高於期待的服務。
      </p>
      <h3 class="text-2xl font-black my-2 tracking-widest">董事長的話</h3>
      <p class="tracking-widest leading-loose mb-8">
        基富通董事長林修銘先生表示：「我們將努力不懈，為客戶的實質利益、使用者的良好體驗及合作夥伴的核心事業發展，創造多贏局面，並堅守發展台灣FINTECH
        ECOSYSTEM的理念，導入對投資人決策有利的第三方服務。」
      </p>
    </article>
  </div>
</template>
