<script setup>
const dataList = [
  { id: 999, code: "代號", label: "金融機構名稱" },
  { id: 998, code: "代號", label: "金融機構名稱" },
  { id: 997, code: "代號", label: "金融機構名稱" },
  { id: 1, code: "004", label: "臺灣銀行" },
  { id: 2, code: "005", label: "臺灣土地銀行" },
  { id: 3, code: "006", label: "合作金庫商業銀行" },
  { id: 4, code: "007", label: "第一商業銀行" },
  { id: 5, code: "008", label: "華南商業銀行" },
  { id: 6, code: "009", label: "彰化商業銀行" },
  { id: 7, code: "011", label: "上海商業儲蓄銀行" },
  { id: 8, code: "012", label: "台北富邦商業銀行" },
  { id: 9, code: "013", label: "國泰世華商業銀行" },
  { id: 10, code: "016", label: "高雄銀行" },
  { id: 11, code: "017", label: "兆豐國際商業銀行" },
  { id: 12, code: "022", label: "美國銀行台北分行" },
  { id: 13, code: "050", label: "台灣中小企業銀行" },
  { id: 14, code: "052", label: "渣打國際商業銀行" },
  { id: 15, code: "053", label: "台中商業銀行" },
  { id: 16, code: "054", label: "京城商業銀行" },
  { id: 17, code: "081", label: "匯豐(台灣)商業銀行" },
  { id: 18, code: "101", label: "瑞興商業銀行" },
];
const remarkList = [
  {
    id: 1,
    content: [
      "600 財團法人全國農漁業及金融資訊中心：",
      "6350017彰化縣線西鄉農會、9190016苗栗縣三義鄉農會、6500018彰化縣福興鄉農會、5110010彰化縣彰化區漁會、9150012苗栗縣西湖鄉農會、9210011苗栗縣南庄鄉農會、5420010臺南市麻豆區農會、5570018臺南市新市區農會、5490017臺南市下營區農會、5680012臺南市七股區農會、5520013臺南市大內區農會、5580019臺南市安定區農會、5620016臺南市仁德區農會、5670011臺南市南化區農會、5510012臺南市官田區農會、5100019苗栗縣南龍區漁會、5080014苗栗縣通苑區漁會、8700018臺中市梧棲區農會、8820013臺中市大肚區農會、6330015彰化縣北斗鎮農會、6360018彰化縣伸港鄉農會、6510019彰化縣彰化市農會、9530012彰化縣田尾鄉農會、6470012彰化縣溪州鄉農會、6990019雲林縣林內鄉農會、5820012南投縣仁愛鄉農會、5800010南投縣鹿谷鄉農會、5750012南投縣中寮鄉農會、6310013彰化縣溪湖鎮農會、6380010彰化縣花壇鄉農會、6390011彰化縣大村鄉農會、6420017彰化縣社頭鄉農會、6460011彰化縣大城鄉農會、6490014彰化縣埔鹽鄉農會、5700017南投縣南投市農會、5770014南投縣魚池鄉農會、5780015南投縣水里鄉農會、5810011南投縣信義鄉農會、8600015南投縣中埔鄉農會、8710019台中市大甲區農會、8800011台中市石岡區農會、8810012台中市新社區農會、8830014台中市外埔區農會、8840015台中市大安區農會。",
    ],
  },
  {
    id: 2,
    content: [
      "910 財團法人農漁會聯合資訊中心：",
      "桃園市桃園區漁會、新竹縣新竹區漁會、桃園市桃園區農會、桃園市大溪區農會、桃園市楊梅區農會、桃園市大園區農會、桃園市蘆竹區農會、桃園市龜山區農會、桃園市八德區農會、桃園市新屋區農會、桃園市龍潭區農會、桃園市復興區農會、桃園市平鎮區農會、桃園市觀音區農會。",
    ],
  },
  {
    id: 3,
    content: [
      "928 板橋區農會電腦共用中心：",
      "901臺中市大里區農會、904新北市新莊區農會、912宜蘭縣冬山鄉農會、916南投縣草屯鎮農會、928新北市板橋區農會。",
    ],
  },
  {
    id: 4,
    content: [
      "951 新北市農會附設北區農會電腦共同利用中心：",
      "基隆區漁會、新北市瑞芳區漁會、新北市萬里區漁會、宜蘭縣頭城區漁會、宜蘭縣蘇澳區漁會、基隆市農會、新北市三重區農會、新北市淡水區農會、新北市樹林區農會、新北市鶯歌區農會、新北市三峽區農會、新北市土城區農會、新北市蘆洲區農會、新北市五股區農會、新北市林口區農會、新北市泰山區農會、新北市坪林區農會、新北市八里區農會、新北市金山地區農會、新北市瑞芳地區農會、新北市新店地區農會、新北市中和地區農會、新北市深坑區農會、新北市石碇區農會、新北市平溪區農會、新北市石門區農會、新北市三芝區農會、宜蘭縣宜蘭市農會、宜蘭縣頭城鎮農會、宜蘭縣羅東鎮農會、宜蘭縣壯圍鄉農會、宜蘭縣員山鄉農會、宜蘭縣五結鄉農會、宜蘭縣蘇澳地區農會、宜蘭縣三星地區農會、台灣省農會、新竹縣關西鎮農會、新竹縣新埔鎮農會、新竹縣竹北市農會、新竹縣湖口鄉農會、新竹縣新竹市農會、新竹縣芎林鄉農會、新竹縣寶山鄉農會、新竹縣峨嵋鄉農會、新竹縣北埔鄉農會、新竹縣竹東地區農會、新竹縣橫山地區農會、新竹縣新豐鄉農會、苗栗縣後龍鎮農會、臺北市北投區農會、臺北市士林區農會、臺北市內湖區農會、臺北市南港區農會、臺北市木柵區農會、臺北市景美區農會。",
    ],
  },
  {
    id: 5,
    content: [
      "952 財團法人農漁會南區資訊中心：",
      "512雲林縣雲林區漁會、515嘉義縣嘉義區漁會、517臺南市南市區漁會、518臺南市南縣漁會、520(高雄市高雄區漁會、高雄市小港區漁會等2家)、521(高雄市興達港區漁會、高雄市林園區漁會、高雄市彌陀區漁會、高雄市永安區漁會、高雄市梓官區漁會等5家)、523(屏東縣琉球區漁會、屏東縣東港區漁會、屏東縣林邊區漁會、屏東縣枋寮區漁會等4家)、524臺東縣新港區漁會、525澎湖縣澎湖區漁會、526金門縣金門區漁會、612(臺中市豐原區農會、臺中市神岡區農會等2家)、613南投縣名間鄉農會、614(彰化縣員林市農會、彰化縣二林鎮農會、彰化縣秀水鄉農會、彰化縣埔心鄉農會、彰化縣永靖鄉農會、彰化縣埤頭鄉農會、彰化縣竹塘鄉農會、彰化縣芬園鄉農會、彰化縣芳苑鄉農會等9家)、616(雲林縣斗六市農會、雲林縣虎尾鎮農會、雲林縣西螺鎮農會、雲林縣斗南鎮農會、雲林縣古坑鄉農會、雲林縣大埤鄉農會、雲林縣莿桐鄉農會、雲林縣二崙鄉農會、雲林縣崙背鄉農會、雲林縣臺西鄉農會、雲林縣褒忠鄉農會、雲林縣四湖鄉農會、雲林縣口湖鄉農會等13家)、617(嘉義縣嘉義市農會、嘉義縣朴子市農會、嘉義縣布袋鎮農會、嘉義縣大林鎮農會、嘉義縣民雄鄉農會、嘉義縣溪口鄉農會、嘉義縣東石鄉農會、嘉義縣義竹鄉農會、嘉義縣鹿草鄉農會、嘉義縣太保市農會、嘉義縣水上鄉農會、嘉義縣番路鄉農會、嘉義縣竹崎地區農會、嘉義縣梅山鄉農會、嘉義縣新港鄉農會、嘉義縣六腳鄉農會等16家)、618(臺南市新營區農會、臺南市鹽水區農會、臺南市佳里區農會、臺南市善化區農會、臺南市六甲區農會、臺南市西港區農會、臺南市將軍區農會、臺南市北門區農會、臺南市玉井區農會、臺南市歸仁區農會、臺南市永康區農會、臺南市楠西區農會等12家)、619(高雄市鳳山區農會、高雄市岡山區農會、高雄市旗山區農會、高雄市美濃區農會、高雄市橋頭區農會、高雄市燕巢區農會、高雄市田寮區農會、高雄市阿蓮區農會、高雄市路竹區農會、高雄市湖內區農會、高雄市茄萣區農會、高雄市彌陀區農會、高雄市永安區農會、高雄市梓官區農會、高雄市林園區農會、高雄市大寮區農會、高雄市仁武區農會、高雄市大社區農會、高雄市杉林區農會、高雄市甲仙地區農會、高雄市六龜區農會、高雄市鳥松區農會、高雄市大樹區農會、高雄市內門區農會等24家)、620(屏東縣東港鎮農會、屏東縣恆春鎮農會、屏東縣麟洛鄉農會、屏東縣九如鄉農會、屏東縣里港鄉農會、屏東縣崁頂鄉農會、屏東縣南州鄉農會、屏東縣琉球鄉農會、屏東縣滿州鄉農會、屏東縣枋山地區農會、屏東市農會、屏東縣車城地區農會、屏東縣農會、屏東縣坊寮地區農會、屏東縣竹田鄉農會、屏東縣萬丹鄉農會、屏東縣長治鄉農會、屏東縣林邊鄉農會、屏東縣佳冬鄉農會、屏東縣高樹鄉農會、屏東縣萬巒地區農會、屏東縣新園鄉農會、屏東縣潮州鎮農會等23家)、621(花蓮縣吉安鄉農會、花蓮縣壽豐鄉農會、花蓮縣富里鄉農會、花蓮縣新秀地區農會等4家)、622(臺東縣關山鄉農會、臺東縣成功鎮農會、臺東縣池上鄉農會、臺東縣東河鄉農會、臺東縣長濱鄉農會、臺東縣臺東地區農會、臺東縣鹿野地區農會、臺東縣太麻里地區農會等8家)、624澎湖縣農會、627連江縣農會、952高雄市小港區農會、613南投縣集集鎮農會、618臺南市柳營區農會。",
    ],
  },
  {
    id: 6,
    content: [
      "954 財團法人農漁會中區資訊中心：",
      "9540105宜蘭縣礁溪鄉農會、9540208彰化縣二水鄉農會、9540301苗栗縣公館鄉農會、9540404嘉義縣阿里山鄉農會、9540507苗栗縣獅潭鄉農會、9540909臺中市龍井區農會、9541102苗栗縣竹南鎮農會、9541205苗栗縣頭份市農會、9541308苗栗縣三灣鄉農會、9541401苗栗縣造橋鄉農會、9541504苗栗縣頭屋鄉農會、9541607苗栗縣苗栗市農會、9541803苗栗縣通霄鎮農會、9541906苗栗縣銅鑼鄉農會、9543003苗栗縣苑裡鎮農會、9543209苗栗縣大湖地區農會、9543508臺中市太平區農會、9543601花蓮縣花蓮市農會、9544402臺中市后里區農會、9544505臺中市清水區農會、9544608臺中市霧峰區農會、9544804臺中市烏日區農會、9544907臺中市潭子區農會、9545100彰化縣和美鎮農會、9545904彰化縣田中鎮農會、9546107雲林縣麥寮鄉農會、9546406雲林縣元長鄉農會、9546808彰化縣鹿港鎮農會、9546901花蓮縣瑞穗鄉農會、9547300臺南市左鎮區農會、9547403臺南市山上區農會、9547702花蓮縣玉溪地區農會、9547805臺南市學甲區農會、9548307臺南市關廟區農會、9548400臺南市龍崎區農會、9548606臺南市白河區農會、9548709臺南市東山區農會、9548802臺南市後壁區農會、9549005屏東縣內埔地區農會、9549108花蓮縣鳳榮地區農會、9549201花蓮縣光豐地區農會、9549304臺中市和平區農會、9549407臺中市大雅區農會、9549603臺中市東勢區農會、9549706臺中市沙鹿區農會、9549809臺南市新化區農會。",
    ],
  },
  {
    id: 7,
    content: [
      "997 中華民國信用合作社聯合社南區聯合資訊處理中心：",
      "104台北市第五信用合作社、120新北市淡水信用合作社、124宜蘭信用合作社、127桃園信用合作社、158彰化第一信用合作社、161彰化第五信用合作社、163彰化第十信用合作社、178嘉義市第三信用合作社、188臺南第三信用合作社、222澎湖縣第一信用合作社、223澎湖第二信用合作社、224金門縣信用合作社。",
    ],
  },
];
</script>

<template>
  <section class="my-4 border border-b-0 border-brown-500">
    <div class="text-center text-2xl text-white bg-brown-500 py-5 px-2">
      參與全國性繳費銀行
    </div>
    <div class="py-5 px-2 text-center bg-gray-200 border-b border-brown-500">
      若您欲進行扣款的銀行尚未與集保簽約，仍可申請自動扣款，但申請時間較久，需20個工作天以上，且交易方式僅限以台幣申購(2020.01.30更新)
    </div>
    <div class="grid md:grid-cols-2 lg:grid-cols-3">
      <div
        class="flex border-b border-brown-500"
        v-for="bank of dataList"
        :key="bank.id"
      >
        <span class="w-16 py-2 text-center bg-yellow-300">{{ bank.code }}</span>
        <span class="flex-grow py-2 text-center">{{ bank.label }}</span>
      </div>
    </div>
    <div class="bg-gray-600 text-white p-4">
      <div
        class="mb-4 pb-4 border-b last:border-b-0 border-black"
        v-for="remark of remarkList"
        :key="remark.id"
      >
        <p>註{{ remark.id }}</p>
        <p v-for="(item, index) of remark.content" :key="index">
          {{ item }}
        </p>
      </div>
    </div>
  </section>
</template>
