<script setup>
const dataList = [
  {
    id: 1,
    label: "Q1.如何申請開戶及應準備哪些文件？",
    content: [
      "若您選擇一般寄件開戶，於線上填寫完開戶資料後，請以單面列印您的開戶文件，並於印鑑卡親簽或留存蓋章型式印鑑。提醒您，需檢附證明文件：身分證正反面影本、第二證件正反面影本（健保卡、本國駕照或護照擇一提供）、約定帳戶存摺封面影本（有姓名、帳號之頁面；無摺帳戶可以網銀截圖代替），並於基金扣款轉帳授權書（一式二聯）上填妥開戶時於銀行留存之印鑑樣式，完成後寄回本公司辦理開戶。若您選擇晶片金融卡方式開戶，您須準備身分證與第二證件電子圖檔及您欲約定之扣款銀行之晶片金融卡(查看可使用晶片金融卡開戶之約定機構請點以下連結)約定機構連結",
      "若您選擇網路銀行線上開戶，請準備身分證與第二證件電子圖檔及欲約定之扣款銀行網銀代號及網銀密碼進行核印",
    ],
  },
  {
    id: 2,
    label: "Q2.請問哪些銀行可以支援晶片金融卡線上開戶？",
    content: [
      "目前支援：臺灣銀行、第一商業銀行、華南商業銀行、台北富邦商業銀行、國泰世華商業銀行、台新國際商業銀行、元大商業銀行、兆豐國際商業銀行、彰化商業銀行之晶片金融卡，查看更多適用銀行請點擊連結(約定機構連結)",
      "目前支援 : 台幣扣款帳戶(外幣需額外書面申請)。",
      "目前支援 ：Windows7以上(IE11以上、Edge、Firefox、Chrome瀏覽器)、MAC(Safari、Chrome瀏覽器)。",
      "開戶最快只需1個工作天 (不含開戶申請當日及假日，且文件審核無誤)。",
    ],
  },
  {
    id: 3,
    label: "Q3.開戶作業到可交易需要多少時間？",
    content: [
      "若您是以「一般寄件開戶」的方式辦理開戶，需以電話與客戶本人詢證後，始得進行開戶作業，因此作業時間將從與您實際取得聯絡後開始計算。同時，提醒您：在完成開戶文件審核、電話照會後，尚需進行指定銀行帳戶基金扣款轉帳的授權，若您約定於集保簽約銀行為華南、兆豐、台新、永豐、台北富邦、中國信託、國泰世華、第一、彰銀、郵局等十家銀行，前九家可配合台、外幣扣款約定，郵局則僅可配合台幣扣款約定扣款，核印作業程序約需5~7個工作天才可完成；若為非集保簽約銀行，則作業程序需要較長的時間完成，約7-14天。",
      "若您是以「晶片金融卡方式開戶」或「網路銀行線上開戶」的方式辦理開戶，完成線上開戶步驟後，經基富通 人工審核，最快僅需一個工作天即可完成開戶（依實際審核狀況為準）。",
    ],
  },
  {
    id: 4,
    label: "Q4.開戶需檢附存摺影本，銀行帳戶如為無摺帳戶(找不到存摺)怎麼辦？",
    content: [
      "如為無摺帳戶或找不到存摺，請您至銀行申請有摺憑據，或提供您的對帳單，或從網銀列印出有帳號之完整頁面，黏貼於存摺帳號影本黏貼處即可。",
      "*提醒您：約定帳戶如為「數位帳戶」，請務必先至銀行新增印鑑樣式。",
    ],
  },
  { id: 5, label: "Q5.我已寄回開戶文件，請問如何知道目前的處理進度？" },
  {
    id: 6,
    label: "Q6.無照片之健保卡是否可作為開戶第二證件？",
    content: ["健保卡上無照片，仍可作為開戶第二證件〪"],
  },
  { id: 7, label: "Q7.如何重新列印我的開戶文件？" },
  { id: 8, label: "Q8.請問如何繼續完成開戶程序？" },
  {
    id: 9,
    label: "Q9.請問幫未成年（未滿20歲）子女開戶要準備什麼文件？",
    content: [
      "未滿20歲之客戶，請利用「一般寄件開戶」開戶，開戶申請書第二頁左下方印鑑卡上需加蓋兩位法定代理人的印章，並檢附法定代理人的身分證正反面影本及受益人戶口名簿影本（滿14歲以上須檢附身分證正反面影本）、第二證件正反面影本，並於基金扣款轉帳授權書（一式二聯）上填妥開戶時於銀行留存的印鑑樣式，完成後寄回本公司辦理開戶。",
      "*單親請加附三個月內申請之戶籍謄本正本。",
      "**約定帳戶須為小孩的帳戶。",
    ],
  },
  {
    id: 10,
    label:
      "Q10.未成年子女開戶時，扣款轉帳授權書之「扣款銀行留存印鑑」樣式該如何填寫？",
    content: [
      "銀行約定帳戶須為未成年子女本人之帳戶，因而扣款銀行留存印鑑樣式應為未成年子女於銀行開戶時留存的印鑑樣式。",
    ],
  },
  {
    id: 11,
    label:
      "Q11.已下載晶片金融卡開戶所需一個安裝執行元件，並且已執行集保基富通晶片金融卡線上開戶安全元件程式，但是在晶片金融卡開戶插卡時，跳出視窗提醒執行兆豐WebATM安裝元件，請問要如何完成開戶？",
    content: [
      "您所使用之電腦應是有安裝防毒軟體(例如：賽門鐵克)，該程式會阻擋兆豐Web ATM元件之執行，需麻煩您先暫時關閉該防毒軟體並重新啟動作業系統，以便進行後續開戶流程。",
    ],
  },
  {
    id: 12,
    label: "Q12.網路銀行開戶需要幾個工作天？",
    content: ["最快只需1個工作天(不含開戶申請當日及假日,且文件審核無誤)。"],
  },
  {
    id: 13,
    label: "Q13.網路銀行開戶目前有幾家銀行可配合？",
    content: [
      "目前有合作金庫、第一銀行、兆豐銀行、華南銀行、彰化銀行、臺灣中小企業銀行、元大銀行、三信商銀可進行網銀開戶,未來可能會再規劃增加其他配合的銀行。",
    ],
  },
  {
    id: 14,
    label: "Q14.請問哪幾家銀行有台外幣整合（綜合）帳戶？",
    content: [
      "目前可透過台北富邦銀行、第一銀行、彰化銀行申請台外幣整合（綜合）帳戶。",
    ],
  },
  {
    id: 15,
    label: "Q15.無法輸入銀行帳號該怎麼辦？",
    content: [
      "請將您的輸入法切換成「英數模式」後，再輸入一次。",
      "請確認您係以「半形」的方式輸入帳號。",
      "檢查該頁面上方有無其他填寫錯誤之處，更正後即可輸入您的銀行帳號。",
    ],
  },
  {
    id: 16,
    label: "Q16.扣款帳號及贖回帳號是否可約定為不同帳戶？",
    content: ["扣款帳號及贖回帳號必須為同一個。"],
  },
  {
    id: 17,
    label:
      "Q17.若欲約定之帳戶為無摺帳戶或找不到存摺，可將網路銀行有帳號的部分截圖列印，但是沒有顯示戶名可以嗎？",
    content: [
      "無摺帳戶或找不到存摺時，您可以網路銀行有帳號之頁面截圖代替，若截圖上未顯示戶名，請於列印下來後於頁面上簽章。",
    ],
  },
  {
    id: 18,
    label: "Q18.基金扣款轉帳授權書上之流水號及檢查碼該如何填寫？",
    content: ["基金扣款轉帳授權書中之「流水號及檢查碼」，毋須填寫。"],
  },
  {
    id: 19,
    label: "Q19.網路銀行可以約定外幣嗎？",
    content: ["目前僅支援台幣扣款帳戶（外幣帳戶約定需以書面方式申請）。"],
  },
  {
    id: 20,
    label: "Q20.哪些銀行可約定外幣扣款？",
    content: [
      "外幣扣款帳戶銀行僅限於集保結算所指定之銀行帳戶：華南、兆豐、台新、永豐、台北富邦、中國信託、國泰世華、第一、彰銀。",
    ],
  },
];
</script>

<template>
  <section class="p-4">
    <div
      class="mb-4 pb-2 border-b border-dashed last:border-b-0"
      v-for="list of dataList"
      :key="list.id"
    >
      <p class="text-brown-500 mb-2">{{ list.label }}</p>
      <div class="pl-4">
        <template v-if="list.content">
          <p v-for="(item, index) of list.content" :key="index" class="mb-2">
            {{ item }}
          </p>
        </template>
        <template v-else-if="list.id === 5">
          <p class="mb-2">
            請您到基富通證券官網首頁（<router-link
              class="text-brown-500 underline"
              to="/"
              >https://www.fundrich.com.tw</router-link
            >），點選上方列之「馬上開戶」下的「開戶進度查詢」的選項，點選後輸入您的身分證字號、原開戶約定的手機號碼，點選發送驗證碼，並輸入驗證碼後，點選「查詢申請進度」的選項，即可自行查詢您目前的開戶進度。
          </p>
        </template>
        <template v-else-if="list.id === 7">
          <p class="mb-2">
            若您未能直接列印文件,請您回到基富通證券官網首頁（<router-link
              class="text-brown-500 underline"
              to="/"
              >https://www.fundrich.com.tw</router-link
            >），點選上方列之「馬上開戶」，將可於畫面中看見「繼續完成開戶（列印文件）」的選項，點選後輸入您的身分證字號、原約定的手機號碼、驗證碼，即可下載列印文件。
          </p>
        </template>
        <template v-else-if="list.id === 8">
          <p class="mb-2">
            線上開戶步驟中斷後，如欲繼續開戶，請您回到基富通證券官網首頁（<router-link
              class="text-brown-500 underline"
              to="/"
              >https://www.fundrich.com.tw</router-link
            >），點選上方列之「馬上開戶」下的「繼續完成開戶（列印文件）」的選項，輸入您的身分證字號、原約定的手機號碼、驗證碼，即可繼續完成開戶。
          </p>
        </template>
      </div>
    </div>
  </section>
</template>
