<script setup>
const statement = [
  "一、依金融消費者保護法最新相關規定，為提供投資人更好的投資服務，本公司即日起施行「投資屬性評估」程序，您於基富通證券網站https://www.fundrich.com.tw完成「投資人投資屬性評量」，本公司將依客戶屬性做商品適合度規範並至少每年請您更新一次，若未能完成屬性評估屆時將會影響您的交易。",
  "二、鑑於目前國際政治及經濟情勢多變，對於所投資之外國證券市場，應注意該外國證券交易市場國家主權評等變動情形，以確保自身投資權益。",
  "三、基金交易係以長期投資為目的，不宜期待於短期內獲取高收益。任何基金單位之價格及其收益均可能漲或跌，故不一定能取回全部之投資金額。投資人申購前應自行了解判斷。",
  "四、外幣計價之基金，投資人須承擔取得收益分配或贖回價金時轉換回新臺幣可能產生之匯率風險。若轉換當時之新臺幣兌換外幣匯率相較於原始投資日之匯率升值時，投資人將承受匯兌損失。",
  "五、各基金所採用之「公平價格調整」（或「反稀釋」）、短線交易及「價格調整機制（或「擺動定價」）」等機制，相關說明請詳各基金公開說明書。投資人應遵守基金公開說明書所列相關交易規定與限制。",
  "六、各基金經金管會核准或同意生效，惟不表示絕無風險。基金經理公司以往之經理績效不保證基金之最低投資收益；基金經理公司除盡善良管理人之注意義務外，不負責本基金之盈虧，亦不保證最低之收益，投資人申購前應詳閱投資人須知或/與基金公開說明書。投資人申購前應自行了解判斷。",
  "七、有關基金應負擔之費用（含分銷費用）已揭露於基金公開說明書及投資人須知，投資人可至公開資訊觀測站或境外基金資訊觀測站中查詢。",
  "八、由於高收益債券之信用評等未達投資等級或未經信用評等，且對利率變動的敏感度甚高，故高收益債券基金可能會因利率上升、市場流動性下降，或債券發行機構違約不支付本金、利息或破產而蒙受虧損。高收益債券基金不適合無法承擔相關風險之投資人，投資人投資以高收益債券為訴求之基金不宜占其投資組合過高之比重。部份基金或所投資之債券子基金，可能投資美國Rule144A債券，該等債券屬私募性質，較可能發生流動性不足，財務訊息揭露不完整或因價格不透明導致波動性較大之風險，投資人須留意相關風險。",
  "九、基金配息率不代表基金報酬率，且過去配息率不代表未來配息率；基金淨值可能因市場因素而上下波動。",
  "十、部分基金配息前未先扣除應負擔之相關費用。基金的配息可能由基金的收益或本金中支付。任何涉及由本金支出的部份，可能導致原始投資金額減損。各基金由本金支付配息之相關資料，投資人可至各投信基金公司及總代理人網站查詢。",
  "十一、本基金涉及投資新興市場部份，因其波動性與風險程度可能較高，且其政治與經濟情勢穩定度可能低於已開發國家，也可能使資產價值受不同程度之影響。依金管會規定：",
  "1.投信基金直接投資大陸地區有價證券僅限掛牌上市有價證券，投資人須留意中國市場特定政治、經濟與市場等投資風險。",
  "2.境外基金投資大陸地區有價證券不得超過該基金資產淨值之20%，投資人須留意中國市場特定政治、經濟與市場等投資風險。",
  "十二、本文提及之經濟走勢預測不必然代表基金之績效，基金投資風險請詳閱基金公開說明書。",
  "十三、投資人因不同時間進場，將有不同之投資績效，過去之績效亦不代表未來績效之保證。",
  "十四、投資人應注意貨幣基金投資之風險包括利率風險、債券交易市場流動性不足之風險及投資無擔保公司債之風險；本基金或有因利率變動、債券交易市場流動性不足及定期存單提前解約而影響基金淨值下跌之風險，同時或有受益人大量贖回時，至延遲給付贖回價款之可能。",
  "十五、基金風險收益等級為投信投顧公會針對基金之價格波動風險程度，依基金投資標的風險屬性與投資地區市場風險狀況編製，分類為RR1-RR5五級，數字越大代表風險越高，此風險級數僅供參考。",
  "十六、本網站最佳瀏覽環境為Chrome45、Firefox45、Safari9.0、InternetExplorer11以上。提醒您，使用InternetExplorer瀏覽可能因安全性設定或其他特殊設定導致頁面無法正確顯示，建議使用Chrome進行瀏覽。",
];
</script>

<template>
  <section class="bg-darkBlue-900 text-gray-400 text-sm py-4">
    <div class="w-full lg:w-lg mx-auto">
      <h6 class="py-2">重要聲明</h6>
      <ul>
        <li
          :class="[{ 'text-brown-500': index === 7 }, 'my-1']"
          v-for="(list, index) of statement"
          :key="index"
        >
          {{ list }}
        </li>
      </ul>
    </div>
  </section>
</template>
