<script setup>
const listData = [
  {
    content: "風險聲明",
    sub: [
      {
        content:
          "此網頁內所載之資訊內容乃基於相信來自可靠消息來源。然而，基富通證券並不保證、擔保或代表 （明示或暗示） 資料內容俱為準確、及時、完整、適當。此網頁之內容是以出版日期為準，然而該等資料或建議可隨時更改，基富通將不會另行通知。如有錯漏或疏失，基富通所屬集團及其負責人與員工，對於您瀏覽本網站提供之意見或資訊所造成之任何後果，不負任何法律責任。本網站之意見或資訊僅為提供參考，並不構成募集或銷售任何國內外有價證券之推介、要約或要約之引誘。本網站僅提供一般性資訊，因此並不一定適合每位投資人。如您有諮詢之需要，請洽您的財務顧問、會計師、律師、或其他專業人士。基富通保留拒絕他人瀏覽本網站之權利。",
      },
      {
        content:
          "您所接觸之本網站資料可能係由第三人準備或發行，基富通證券提供該等資料僅供您參考。資料中並無基富通證券提供之任何資訊，且基富通證券對其中包含之內容、觀點，及意見均未查證且無法負責。基富通證券對於使用此等資料所造成之任何損失均不負責。使用該等資料者不應僅依賴此資料，而未進行個別獨立之判斷。基富通可能寄送予您或他人與該資料不符或有不同結論之報告。該等資料可能受著作權保護且不得被傳送與其他人。您對資料之任何進一步傳送，不論全部或一部，均可能使您面臨侵害著作權之訴訟。",
      },
    ],
  },
  {
    content: "智慧財產權",
    remark:
      "本網站及內容所有相關之著作權、資料、專利，及其他相關權利均為、其授權人、或資料提供者所有。本網站內之所有資訊均受著作權法保護。您僅得為自己非營利之合法目的而使用，並僅得為前開之目的重製一份書面。除上述外，任何本網站之資料不得以任何方式重製、散佈、傳送至他人或其他資料庫或被整理成任何其他資料。您所自行製作之任何版本必須包含著作權聲明及免責聲明。",
  },
  {
    content: "網站連結",
    sub: [
      {
        content:
          "本網站為您的便利可能建立某些連結引向基富通證券無管理權之其他網站，您應自行決定是否使用。該等外部網站所提供之內容與基富通證券無關且該等網站所提供之建議或意見亦非基富通證券所提供。基富通證券對該等外部網站內容之正確性、完整性、合法性及即時性並不作出任何擔保。基富通證券亦不對您因信賴其他網站之內容所造成之任何損害負責。",
      },
      {
        content:
          "您於未得到基富通事先之書面同意前，不得與本網站首頁以外之其他網頁連結，亦不得架設任何基富通網站或使人誤認其為基富通網站之網站，或對其作任何畫面變更，或使用我們的著作權所有物。",
      },
    ],
  },
];
</script>

<template>
  <div class="p-2 lg:w-lg lg:mx-auto">
    <h2 class="text-center text-xl font-black mb-4">網站資訊聲明</h2>
    <ul class="list pl-8 pr-4">
      <li v-for="list of listData" :key="list.content">
        <p class="my-2">{{ list.content }}</p>
        <p class="my-2">{{ list.remark }}</p>
        <ul v-if="list.sub" class="list-decimal pl-4">
          <li v-for="(subList, i) of list.sub" :key="i">
            <p class="my-2">{{ subList.content }}</p>
            <p class="my-2">{{ subList.remark }}</p>
            <ul v-if="subList.sub" class="list-disc pl-4">
              <li v-for="(grand, ind) of subList.sub" :key="ind" class="my-2">
                {{ grand.content }}
              </li>
            </ul>
          </li>
        </ul>
        <p class="my-2">{{ list.endRemark }}</p>
      </li>
    </ul>
  </div>
</template>

<style scoped>
.list {
  list-style-type: cjk-decimal;
}
</style>
